#include <iostream>
using namespace std;


int main()
{
    // Array е збир на повеќе променливи од ист тип

    // Синтакса
    // tip imeNaArray[golemina];

    // Сите елементи во еден Array имаат свој индекс
    // Индексот ја претставува позицијата на елементот во еден Array
    // Првиот елемент има индекс 0, па секој нареден се зголемува за еден

    //                       0  1  2  3   4    5    6    7
    int IntegerArray[10] = { 5, 3, 6, 0 , 9 , 112, 240, -24 };

    // Задавање на вредност на елементи во Array
    IntegerArray[8] = 1;
    IntegerArray[0] = 2;

    // Печатење на Array мора да биде со loop
    for(int i=0; i<10; i++) {
        cout<<IntegerArray[i] << " " ;
    }
    // Доколку сакаме корисникот да ги внесе елементите во Array-от
    for(int i=0; i<10; i++) {
        cin>>IntegerArray[i];
    }

    // float секогаш има децимално место
    // Пример за Array од тип float
    float Array[10] = { 1.1, 2.1, 3.2, 5.5, 4.2};

    for(int i=0;i<10;i++) {
        cout << Array[i] << " ";
    }


    // Пример за Array од тип char (char Array)
    // char Array е ИСКЛУЧОК, тука не мора да дефинираме големина на Array
    char Array2[] = {"\nHello"};

    // Печатење на Array од тип char
    // Проверуваме карактери додека не дојдеме до '\0'
    // \0 претставува null pointer, или крај на некој ВЛЕЗ (input)
    int j=0;
    while(Array2[j] != '\0') {
        cout<<Array2[j];
        j++;
    }

    // Други специјални карактери кои можеби ќе се корисни (спомнати на час)
    // '\n' -> new line, со овој специјален карактер означуваме нов ред
    // '\t' -> tabulator, tab, со овој специјален карактер означуваме таб во текстот
    // Новиот ред и табулатор се користат во променливи со карактери или стрингови

    return 0;
}
