#include <iostream>
using namespace std;

int main()
{
  /*
    Постојат повеќе видови на loops -> for loops / while loops / do-while loops
    Loops се итерирачки структури (структури кои се повторуваат)
    Loops во C++ се градат со char, int, float variables, односно итерираме променливи
    од тип char, int, float
  */

  /*
      For loops - синтакса
      for(cekor 1; cekor 2; cekor 3) {
          nekoja naredba
      }

      1 чекор: поставуваме вредност ОД која сакаме да почне loopot (и доколку сакаме воедно можеме да ја иницијализираме променливата)
      2 чекор: поставуваме ДО која вредност сакаме да трае loopot или кога да заврши
      3 чекор: услов како истата променлива ќе дојде ОД чекор 1 ДО чекор 2
  */

    // Пример за првите 10 броеви
    for(int i = 1; i <= 10; i++) {
      cout << i << endl;
    }

    // Пример за истиот loop, но во обратен редослед, односно од 10 до 0
    for(int i = 10; i >= 1; i--) {
      cout << i << endl;
    }

    // Пример за првите 10 парни броеви
    for(int i = 0; i < 10; i+=2) {
      cout << i << endl;
    }

    // Пример за првите 10 непарни броеви
    for(int i = 1; i < 10; i+=2) {
      cout << i << endl;
    }

    // Пример за парните броеви од 10 до 30
    for(int i = 10; i <= 30; i+=2){
      cout << i << endl;
    }

    /*
      Сите услови може да се менуваат по наш избор, само треба да се запази синтаксата!
      Доколку loopot не го исполнува првичниот услов, тој нема да врати error, него едноставно нема да го изврши
    */

    // Пример за горенаведеното
    for(int i=0; i<0; i++) {
      cout << i << endl;
    }

    /*
      Како компјутерот ги гледа лооп-овите? Како се извршуваат?
      Пример обична итерација од 0 до 2 (погледни доле)

      Прво иницијализираме i=0, па проверуваме дали 0 е помало од 2 - ДА е
      Се извршува се во { } заградите, односно го печатиме бројот 0
      Потоа чекор 3, односно i++ - сега i = 1, проверуваме дали 1 е помало од 2 - ДА е, па затоа извршуваме се во { } заградата односно печатиме 1
      Потоа пак чекор 3, сега i = 2, проверуваме дали 2 е помало од 2 - НЕ не е! Лооп-от завршува.
      На самиот крај се печати 0 1
      И променливата i има вредност 2!

      for(int i=0;i<2;i++){
        cout<< i <<;
      }
    */

    return 0;
}