#include <iostream>
using namespace std;

/*	Функција е блок од код кој извршува одредена задача
    Функциите се пишуваат надвор од int main() -> главната функција

    Синтакса
    Функциите се составени од два дела
    1) Создавање на функцијата (линиза 31) која стои надвор од главната функција (int main), со наредната синтакса
    ТИП Име(иницијализација на параметрите кои ги праќаме)
    - имињата на параметри може, но НЕ мора да се исти како на параметрите во главната функција (int main)

    2) Повикување на функцијата (линија 37, 38, 39) која се прави исклучилно во главната функција (int main)
    Име(параметри)

    Битно е да го запазиме типот на функцијата, како и типот и бројот на параметри кои ги праќаме

    Како се извршуваат функциите?
    Компајлерот го гледа само int main(), доаѓа нашата функција (пример линија 37), компајлерот ја бара таа функција
    и враќа вредности на одреден број параметри. Кога компајлерот ќе ја најде функцијата, тој бара иницијализација на
    параметрите кои се пратени од главната функција (int main). Потоа го извршува кодот и соодветно враќа резултат.

    Постојат 2 типа на фунцкии
    - функции кои враќаат вредност (int, float, string), во овие функции мора да вратиме некоја променлива/вредност
    назад кон главната функција (int main). Ова го правиме со клучниот збор return, кој го поставуваме на крајот на функцијата

    - функции кои не враќаат вредност, односно void фунцкии, овие фунцкии најчесто служат за печатење во конзола и
    не треба да имаат return statement
*/

int addingNumbers(int a,int b) {
    return a+b;
}

int main()
{
    int sumOfAddingNumber = addingNumbers(2,3);
    int sumOfAddingNumber2 = addingNumbers(3,3);
    int sumOfAddingNumber3 = addingNumbers(5,5);

    cout<<sumOfAddingNumber<<" "<<sumOfAddingNumber2<<" "<<sumOfAddingNumber3;

    // Најголема предност на користењето функции е реискористливоста на кодот, како и јасен код - логиката ја поместуваме на страна,
    // надвор од главната функција (int main)

    return 0;
}